# Lab | Data Aggregation and Filtering

In this challenge, we will continue to work with customer data from an insurance company. We will use the dataset called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by first performing data cleaning, formatting, and structuring.

In [1]:
import pandas as pd
marketing_data = pd.read_csv('https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis.csv')
marketing_data.head(2)

,Unnamed: 0,Customer,State,Customer Lifetime Value,Response,Coverage,Education,Effective To Date,EmploymentStatus,Gender,...,Number of Open Complaints,Number of Policies,Policy Type,Policy,Renew Offer Type,Sales Channel,Total Claim Amount,Vehicle Class,Vehicle Size,Vehicle Type
0,0,DK49336,Arizona,4809.216960,No,Basic,College,2/18/11,Employed,M,...,0.0,9,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,NaN
1,1,KX64629,California,2228.525238,No,Basic,College,1/18/11,Unemployed,F,...,0.0,1,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,NaN

In [2]:
marketing_data.dtypes

Unnamed: 0                         int64
Customer                          object
State                             object
Customer Lifetime Value          float64
Response                          object
Coverage                          object
Education                         object
Effective To Date                 object
EmploymentStatus                  object
Gender                            object
Income                             int64
Location Code                     object
Marital Status                    object
Monthly Premium Auto               int64
Months Since Last Claim          float64
Months Since Policy Inception      int64
Number of Open Complaints        float64
Number of Policies                 int64
Policy Type                       object
Policy                            object
Renew Offer Type                  object
Sales Channel                     object
Total Claim Amount               float64
Vehicle Class                     object
Vehicle Size                      object
Vehicle Type                      object
dtype: object

In [3]:
import functions
# apply cleaning functions
marketing_data = functions.clean_dataframe(marketing_data)

In [4]:
# check on remaining nulls
marketing_data.isnull().sum()

unnamed:_0                          0
customer                            0
state                             631
customer_lifetime_value             0
response                          631
coverage                            0
education                           0
effective_to_date                   0
employmentstatus                    0
gender                              0
income                              0
location_code                       0
marital_status                      0
monthly_premium_auto                0
months_since_last_claim           633
months_since_policy_inception       0
number_of_open_complaints         633
number_of_policies                  0
policy_type                         0
policy                              0
renew_offer_type                    0
sales_channel                       0
total_claim_amount                  0
vehicle_class                     622
vehicle_size                      622
vehicle_type                     5482
dtype: int64

In [5]:
marketing_data.shape

(10910, 26)

In [7]:
# Cleaning 'State'
marketing_data['state'].value_counts(dropna=False)

state
California    3552
Oregon        2909
Arizona       1937
Nevada         993
Washington     888
NaN            631
Name: count, dtype: int64

In [45]:
#not clear what's the best approach but I will just fill the nans with California
marketing_data['state'] = marketing_data['state'].fillna("California")

In [47]:
# Cleaning 'Response'
# mostly "no response" given
# NaNs can be replaced with "no" as the distribution wouldn't change to much
display(marketing_data['response'].value_counts(dropna=False))

response
No     8813
Yes    1466
NaN     631
Name: count, dtype: int64

In [49]:
marketing_data['response'] = marketing_data['response'].fillna("No")

In [50]:
display(marketing_data['response'].value_counts(dropna=False))

response
No     9444
Yes    1466
Name: count, dtype: int64

In [51]:
# Cleaning "Vehicle Class"
# mostly Four-Door Car
# NaNs can be replaced with Four-Door Car as the distribution wouldn't change to much
display(marketing_data['vehicle_class'].value_counts(dropna=False))

vehicle_class
Four-Door Car    5834
Two-Door Car     2118
SUV              2012
Sports Car        550
Luxury SUV        208
Luxury Car        188
Name: count, dtype: int64

In [52]:
marketing_data['vehicle_class'] = marketing_data['vehicle_class'].fillna("Four-Door Car")
display(marketing_data['vehicle_class'].value_counts(dropna=False))

vehicle_class
Four-Door Car    5834
Two-Door Car     2118
SUV              2012
Sports Car        550
Luxury SUV        208
Luxury Car        188
Name: count, dtype: int64

In [53]:
# Cleaning "Vehicle Size"
# mostly Medsize
# NaNs can be replaced with Medsize as the distribution wouldn't change to much
display(marketing_data['vehicle_size'].value_counts(dropna=False))

vehicle_size
Midsize    7873
Small      1966
Large      1071
Name: count, dtype: int64

In [54]:
marketing_data['vehicle_size'] = marketing_data['vehicle_size'].fillna("Medsize")
# Fixing typo
marketing_data['vehicle_size'] = marketing_data['vehicle_size'].replace("Medsize", "Midsize")
display(marketing_data['vehicle_size'].value_counts(dropna=False))

vehicle_size
Midsize    7873
Small      1966
Large      1071
Name: count, dtype: int64

In [55]:
# Cleaning "Vehicle Type"
# mostly A but actually here should be something like car, truck, motorcycle.
# cannot use this information and therefore will disregard this column / could also drop it
display(marketing_data['vehicle_type'].value_counts(dropna=False))

vehicle_type
NaN    5482
A      5428
Name: count, dtype: int64

In [56]:
display(marketing_data[['months_since_last_claim']].describe())
display(marketing_data[['months_since_last_claim']].median())

       months_since_last_claim
count             10910.000000
mean                 15.082401
std                   9.787208
min                   0.000000
25%                   7.000000
50%                  14.000000
75%                  23.000000
max                  35.000000

months_since_last_claim    14.0
dtype: float64

In [57]:
# NaNs will be replaced with the median. It's similar to the mean and displays an even number instead of one with decimals.
marketing_data['months_since_last_claim'] = marketing_data['months_since_last_claim'].fillna(marketing_data['months_since_last_claim'].median())

In [58]:
# stats haven't changed too much after filling NaNs
display(marketing_data[['months_since_last_claim']].describe())

       months_since_last_claim
count             10910.000000
mean                 15.082401
std                   9.787208
min                   0.000000
25%                   7.000000
50%                  14.000000
75%                  23.000000
max                  35.000000

In [59]:
display(marketing_data[['number_of_open_complaints']].describe())
print(f"The median is: {marketing_data['number_of_open_complaints'].median()}")

       number_of_open_complaints
count               10910.000000
mean                    0.361962
std                     0.890134
min                     0.000000
25%                     0.000000
50%                     0.000000
75%                     0.000000
max                     5.000000

The median is: 0.0

In [60]:
# NaNs will be replaced with the median. It's similar to the mean and displays an even number instead of one with decimals.
marketing_data['number_of_open_complaints'] = marketing_data['number_of_open_complaints'].fillna(marketing_data['number_of_open_complaints'].median())
# Stats don't change too much after this adaption.
display(marketing_data[['number_of_open_complaints']].describe())

       number_of_open_complaints
count               10910.000000
mean                    0.361962
std                     0.890134
min                     0.000000
25%                     0.000000
50%                     0.000000
75%                     0.000000
max                     5.000000

In [61]:
# check on remaining nulls
marketing_data.isnull().sum()

unnamed:_0                          0
customer                            0
state                               0
customer_lifetime_value             0
response                            0
coverage                            0
education                           0
effective_to_date                   0
employmentstatus                    0
gender                              0
income                              0
location_code                       0
marital_status                      0
monthly_premium_auto                0
months_since_last_claim             0
months_since_policy_inception       0
number_of_open_complaints           0
number_of_policies                  0
policy_type                         0
policy                              0
renew_offer_type                    0
sales_channel                       0
total_claim_amount                  0
vehicle_class                       0
vehicle_size                        0
vehicle_type                     5482
date_month                          0
dtype: int64

### 1. Create a new DataFrame that only includes customers who have a total_claim_amount greater than $1,000 and have a response of "Yes" to the last marketing campaign.

In [62]:
customer_analysis = marketing_data[(marketing_data['total_claim_amount']>=1000) & (marketing_data['response'] == "Yes")]
#customer_analysis = marketing_data[['customer','total_claim_amount']]
#customer_analysis = marketing_data[(marketing_data['total_claim_amount']>=1000) & (marketing_data['response'] == "Yes")].loc[:,['customer','response','total_claim_amount']]
display(customer_analysis.head(2))

,unnamed:_0,customer,state,customer_lifetime_value,response,coverage,education,effective_to_date,employmentstatus,gender,...,number_of_policies,policy_type,policy,renew_offer_type,sales_channel,total_claim_amount,vehicle_class,vehicle_size,vehicle_type,date_month
189,189,OK31456,California,11009.13049,Yes,Premium,Bachelor,2011-01-24,Employed,F,...,1,Corporate Auto,Corporate L3,Offer2,Agent,1358.4,Luxury Car,Midsize,NaN,January
236,236,YJ16163,Oregon,11009.13049,Yes,Premium,Bachelor,2011-01-24,Employed,F,...,1,Special Auto,Special L3,Offer2,Agent,1358.4,Luxury Car,Midsize,A,January

2. Using the original Dataframe, analyze the average total_claim_amount by each policy type and gender for customers who have responded "Yes" to the last marketing campaign. Write your conclusions.

In [63]:
customer_analysis2 = marketing_data[(marketing_data['response'] == "Yes")]
analysis_groupby = customer_analysis2.groupby(['gender','policy_type']).agg({'total_claim_amount':'mean'}).round(2)
analysis_groupby.rename(columns={'total_claim_amount':'average_claim_amount'})

                       average_claim_amount
gender policy_type
F      Corporate Auto                433.74
       Personal Auto                 452.97
       Special Auto                  453.28
M      Corporate Auto                408.58
       Personal Auto                 457.01
       Special Auto                  429.53

#### Insights:
- Female customers have on average the highest claim amount policy type "Special Auto". This is different for male customers. Here the highest average claim amount is for type "Personal Auto".
- However, also Female claim a high average amount in the "Personal Autos" type.
- In general, the average claim amount doesn't differ to much when comparing the three policy types.

3. Analyze the total number of customers who have policies in each state, and then filter the results to only include states where there are more than 500 customers.

In [64]:
state_customer_count = marketing_data.groupby(['state']).agg({'customer':'count'}).sort_values(by='customer', ascending=False)
display(state_customer_count)

            customer
state
California      4183
Oregon          2909
Arizona         1937
Nevada           993
Washington       888

In [65]:
#state_customer_count = state_customer_count.reset_index()

In [66]:
# filter to show only states with more than 500 customers 
display(state_customer_count[(state_customer_count['customer']>=500)])

            customer
state
California      4183
Oregon          2909
Arizona         1937
Nevada           993
Washington       888

4. Find the maximum, minimum, and median customer lifetime value by education level and gender. Write your conclusions.

In [67]:
analysis = marketing_data.groupby(['gender']).agg({'customer_lifetime_value':['max','min','median']}).round(2)
display(analysis)

       customer_lifetime_value
                           max      min   median
gender
F                     73225.96  1898.68  5714.17
M                     83325.38  1898.01  5824.22

#### Insights:
- The median CLV is higher for men than for women.
- The minimum CLV is similar for both genders.
- The maximum CLV is higher for men.

In [68]:
marketing_data.groupby(['gender','education']).agg({'customer_lifetime_value':['max','min','median','mean']}).round(2)

                            customer_lifetime_value
                                                max      min   median     mean
gender education
F      Bachelor                            73225.96  1904.00  5640.51  7874.27
       College                             61850.19  1898.68  5623.61  7748.82
       Doctor                              44856.11  2395.57  5332.46  7328.51
       High School or Below                55277.45  2144.92  6039.55  8675.22
       Master                              51016.07  2417.78  5729.86  8157.05
M      Bachelor                            67907.27  1898.01  5548.03  7703.60
       College                             61134.68  1918.12  6005.85  8052.46
       Doctor                              32677.34  2267.60  5577.67  7415.33
       High School or Below                83325.38  1940.98  6286.73  8149.69
       Master                              50568.26  2272.31  5579.10  8168.83

#### Insights:
Looking at the education levels within the gender groups, it strikes out that:
- The median CLV is the highest for customers with a 'High School or Below" degree. This is the same for men as well as for women.
- The minimum CLV within female is coming from a customer having a College degree. Within male it's coming from a customer having a Bachelor degree.
- The maximium CLV within female is coming from a customer having a Bachelor degree. Within male it's coming from a customer having a 'High School or Below" degree.

- The range between minimum and maximum values is very high. Overall, the medians show a huge gap to the maximum values in the respective categories. This indicates that there must be only a few customers with significant higher CLVs.

## Bonus

5. The marketing team wants to analyze the number of policies sold by state and month. Present the data in a table where the months are arranged as columns and the states are arranged as rows.

In [69]:
marketing_data['effective_to_date'] = pd.to_datetime(marketing_data['effective_to_date'], errors='coerce', format="%m/%d/%y")
# create a new column, get the month out of the date, and convert it to string
marketing_data['effective_to_date']
marketing_data['date_month'] = marketing_data['effective_to_date'].apply(lambda x: x.month).astype(str)
#marketing_data[['effective_to_date','date_month']]
month_dict = {'1': 'January', '2': 'February'}
marketing_data['date_month'] = marketing_data['date_month'].map(month_dict)
marketing_data['date_month']

0        February
1         January
2        February
3         January
4         January
           ...
10905     January
10906     January
10907    February
10908    February
10909     January
Name: date_month, Length: 10910, dtype: object

In [70]:
marketing_data.pivot_table(columns='date_month', index='state', values="policy", aggfunc='count')

date_month  February  January
state
Arizona          929     1008
California      1952     2231
Nevada           442      551
Oregon          1344     1565
Washington       425      463

6.  Display a new DataFrame that contains the number of policies sold by month, by state, for the top 3 states with the highest number of policies sold.

*Hint:*
- *To accomplish this, you will first need to group the data by state and month, then count the number of policies sold for each group. Afterwards, you will need to sort the data by the count of policies sold in descending order.*
- *Next, you will select the top 3 states with the highest number of policies sold.*
- *Finally, you will create a new DataFrame that contains the number of policies sold by month for each of the top 3 states.*

In [71]:
# 1a. group by state & month and count no. of policies sold for each group
# 1b. sort sold policies in desc order
marketing_analysis = marketing_data.pivot_table(index=['date_month','state'], values="number_of_policies", aggfunc='sum').sort_values(by='number_of_policies', ascending=False)

In [72]:
marketing_analysis = marketing_analysis.reset_index()
marketing_analysis

  date_month       state  number_of_policies
0    January  California                6666
1   February  California                5901
2    January      Oregon                4697
3   February      Oregon                3969
4    January     Arizona                3052
5   February     Arizona                2864
6    January      Nevada                1493
7    January  Washington                1358
8   February      Nevada                1278
9   February  Washington                1225

In [73]:
# 2a. select the top 3 states with the highest number of policies sold.
top_states = marketing_analysis.groupby('state').agg({'number_of_policies':'sum'}).nlargest(3,'number_of_policies').reset_index()
print(top_states)

        state  number_of_policies
0  California               12567
1      Oregon                8666
2     Arizona                5916

In [74]:
# 2b. create a list of the top 3 to use them as a filter
print(top_states.columns)
#list_top_states
list_top_states = top_states['state'].unique()
print(list_top_states)

Index(['state', 'number_of_policies'], dtype='object')
['California' 'Oregon' 'Arizona']

In [75]:
# 3. create a new DF with number of policies sold by month for each of the top 3 states.
marketing_analysis[(marketing_analysis['state'].isin(list_top_states))].pivot_table(index=['state'], columns='date_month', values="number_of_policies", aggfunc='sum')#.reset_index()

date_month  February  January
state
Arizona         2864     3052
California      5901     6666
Oregon          3969     4697

#### Insights:
- The Top 3 States in terms of Policies Sold are: Arizona, California, and Oregon.
- In January and February, most policies were sold in California.

7. The marketing team wants to analyze the effect of different marketing channels on the customer response rate.

Hint: You can use melt to unpivot the data and create a table that shows the customer response rate (those who responded "Yes") by marketing channel.

External Resources for Data Filtering: https://towardsdatascience.com/filtering-data-frames-in-pandas-b570b1f834b9

In [76]:
test1 = marketing_data.groupby(['sales_channel', 'response']).agg({'response':'count'})
test1.columns = ['response count']
test1

                        response count
sales_channel response
Agent         No                  3379
              Yes                  742
Branch        No                  2696
              Yes                  326
Call Center   No                  1920
              Yes                  221
Web           No                  1449
              Yes                  177

#### Conclusion: Not filtered by 'Yes' but gives an overview of the distribution of 'Yes/No' Responses. This shows that mostly no responses were given.